

In summary here are the 20 pandas functions that can be used to accomplish most of yourdata tasks:
1. pd.read_csv()
2. df.describe()
3. df.info()
4. df.plot()
5. df.iloc()
6. df.loc()
7. df.assign()
8. df.query()
9. df.sort_values()
10. df.sample()
11. df.isnull()
12. df.fillna()
13. df.dropna()
14. df.drop()
15. pd.pivot_table()
16. df.groupby()
17. df.transpose()
18. df.merge()
19. df.rename()

### IMPORT LIBRARIES

In [1]:
import os
import pandas as pd

### DEFINE THE WORKING DIRECTORY

In [2]:
wd_path = os.path.abspath(
    'C:\\Users\\Asus VivoBook\\Dropbox\\My PC (DESKTOP-GN5CQHE)\\Desktop\\Documentos\\The Vault\\Python\\PyWD'
    )

In [3]:
# Check if the WD exists
if not os.path.exists(wd_path):
    # create the directory if it doesn't exist
    os.makedirs(wd_path)

In [4]:
# Get the WD
os.getcwd()

'C:\\Users\\Asus VivoBook\\AnthonyCRENG28\\Definitive_Guide'

In [ ]:
# Additionally Options:
# You can change the WD path as follows:
os.chdir("C:\\Users\\DELL\\Documents\\")
os.getcwd()

### READ FILES

In [6]:
# CSV
df_csv = pd.read_csv('C:\\Users\\Asus VivoBook\\Dropbox\\My PC (DESKTOP-GN5CQHE)\\Desktop\\Documentos\\The Vault\\Python\\PyWD\\csv_01.csv')

### Dimensiones

In [11]:
df_csv.ndim

2

### Size

In [12]:
df_csv.size

388164

### Headers

In [13]:
df_csv.columns

Index(['CustomerKey', 'FirstName', 'LastName', 'FullName', 'BirthDate',
       'MaritalStatus', 'Gender', 'YearlyIncome', 'TotalChildren',
       'NumberChildrenAtHome', 'Education', 'Occupation', 'HouseOwnerFlag',
       'NumberCarsOwned', 'AddressLine1', 'DateFirstPurchase',
       'CommuteDistance', 'CustomerCity', 'CustomerStateCode', 'CustomerState',
       'CustomerCountry'],
      dtype='object')

### Head - Tail

In [7]:
df_csv.head(3)

,CustomerKey,FirstName,LastName,FullName,BirthDate,MaritalStatus,Gender,YearlyIncome,TotalChildren,NumberChildrenAtHome,...,Occupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,DateFirstPurchase,CommuteDistance,CustomerCity,CustomerStateCode,CustomerState,CustomerCountry
0,11000,Jon,Yang,"Yang, Jon",1966-04-08,M,M,90000,2,0,...,Professional,1,0,3761 N. 14th St,2005-07-22,1-2 Miles,Rockhampton,QLD,Queensland,Australia
1,11001,Eugene,Huang,"Huang, Eugene",1965-05-14,S,M,60000,3,3,...,Professional,0,1,2243 W St.,2005-07-18,0-1 Miles,Seaford,VIC,Victoria,Australia
2,11002,Ruben,Torres,"Torres, Ruben",1965-08-12,M,M,60000,3,3,...,Professional,1,1,5844 Linden Land,2005-07-10,2-5 Miles,Hobart,TAS,Tasmania,Australia

In [19]:
df_csv.tail(3)

,CustomerKey,FirstName,LastName,FullName,BirthDate,MaritalStatus,Gender,YearlyIncome,TotalChildren,NumberChildrenAtHome,...,Occupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,DateFirstPurchase,CommuteDistance,CustomerCity,CustomerStateCode,CustomerState,CustomerCountry
18481,29481,Ivan,Suri,"Suri, Ivan",1960-01-05,S,M,30000,3,0,...,Clerical,0,0,Knaackstr 4,2006-02-13,0-1 Miles,Hof,BY,Bayern,Germany
18482,29482,Clayton,Zhang,"Zhang, Clayton",1959-03-05,M,M,30000,3,0,...,Clerical,1,0,"1080, quai de Grenelle",2007-03-22,0-1 Miles,Saint Ouen,17,Charente-Maritime,France
18483,29483,JÃ©sus,Navarro,"Navarro, JÃ©sus",1959-12-08,M,M,30000,0,0,...,Clerical,1,0,"244, rue de la Centenaire",2007-03-13,0-1 Miles,Paris La Defense,92,Hauts de Seine,France

### Info Metadata

In [8]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerKey           18484 non-null  int64
 1   FirstName             18484 non-null  object
 2   LastName              18484 non-null  object
 3   FullName              18484 non-null  object
 4   BirthDate             18484 non-null  object
 5   MaritalStatus         18484 non-null  object
 6   Gender                18484 non-null  object
 7   YearlyIncome          18484 non-null  int64
 8   TotalChildren         18484 non-null  int64
 9   NumberChildrenAtHome  18484 non-null  int64
 10  Education             18484 non-null  object
 11  Occupation            18484 non-null  object
 12  HouseOwnerFlag        18484 non-null  int64
 13  NumberCarsOwned       18484 non-null  int64
 14  AddressLine1          18484 non-null  object
 15  DateFirstPurchase     18484 non-null  object
 16  CommuteDistance       18484 non-null  object
 17  CustomerCity          18484 non-null  object
 18  CustomerStateCode     18484 non-null  object
 19  CustomerState         18484 non-null  object
 20  CustomerCountry       18484 non-null  object
dtypes: int64(6), object(15)
memory usage: 3.0+ MB

### Type

In [9]:
type(df_csv)

pandas.core.frame.DataFrame

### Info

In [10]:
df_csv.info

<bound method DataFrame.info of        CustomerKey  FirstName LastName            FullName   BirthDate  \
0            11000        Jon     Yang           Yang, Jon  1966-04-08
1            11001     Eugene    Huang       Huang, Eugene  1965-05-14
2            11002      Ruben   Torres       Torres, Ruben  1965-08-12
3            11003    Christy      Zhu        Zhu, Christy  1968-02-15
4            11004  Elizabeth  Johnson  Johnson, Elizabeth  1968-08-08
...            ...        ...      ...                 ...         ...
18479        29479      Tommy     Tang         Tang, Tommy  1958-07-04
18480        29480       Nina     Raji          Raji, Nina  1960-11-10
18481        29481       Ivan     Suri          Suri, Ivan  1960-01-05
18482        29482    Clayton    Zhang      Zhang, Clayton  1959-03-05
18483        29483      JÃ©sus  Navarro      Navarro, JÃ©sus  1959-12-08

      MaritalStatus Gender  YearlyIncome  TotalChildren  NumberChildrenAtHome  \
0                 M      M         90000              2                     0
1                 S      M         60000              3                     3
2                 M      M         60000              3                     3
3                 S      F         70000              0                     0
4                 S      F         80000              5                     5
...             ...    ...           ...            ...                   ...
18479             M      M         30000              1                     0
18480             S      F         30000              3                     0
18481             S      M         30000              3                     0
18482             M      M         30000              3                     0
18483             M      M         30000              0                     0

       ...    Occupation HouseOwnerFlag  NumberCarsOwned  \
0      ...  Professional              1                0
1      ...  Professional              0                1
2      ...  Professional              1                1
3      ...  Professional              0                1
4      ...  Professional              1                4
...    ...           ...            ...              ...
18479  ...      Clerical              1                0
18480  ...      Clerical              1                0
18481  ...      Clerical              0                0
18482  ...      Clerical              1                0
18483  ...      Clerical              1                0

                    AddressLine1 DateFirstPurchase CommuteDistance  \
0                3761 N. 14th St        2005-07-22       1-2 Miles
1                     2243 W St.        2005-07-18       0-1 Miles
2               5844 Linden Land        2005-07-10       2-5 Miles
3               1825 Village Pl.        2005-07-01      5-10 Miles
4            7553 Harness Circle        2005-07-26       1-2 Miles
...                          ...               ...             ...
18479          111, rue Maillard        2007-03-08       0-1 Miles
18480          9 Katherine Drive        2008-01-18       0-1 Miles
18481                Knaackstr 4        2006-02-13       0-1 Miles
18482     1080, quai de Grenelle        2007-03-22       0-1 Miles
18483  244, rue de la Centenaire        2007-03-13       0-1 Miles

           CustomerCity CustomerStateCode      CustomerState CustomerCountry
0           Rockhampton               QLD         Queensland       Australia
1               Seaford               VIC           Victoria       Australia
2                Hobart               TAS           Tasmania       Australia
3            North Ryde               NSW    New South Wales       Australia
4            Wollongong               NSW    New South Wales       Australia
...                 ...               ...                ...             ...
18479        Versailles                78            Yveline          France
18480            London               ENG            England  United Kingdom
18481               Hof                BY             Bayern         Germany
18482        Saint Ouen                17  Charente-Maritime          France
18483  Paris La Defense                92     Hauts de Seine          France

[18484 rows x 21 columns]>

### Describe

In [15]:
df_csv.describe

<bound method NDFrame.describe of        CustomerKey  FirstName LastName            FullName   BirthDate  \
0            11000        Jon     Yang           Yang, Jon  1966-04-08
1            11001     Eugene    Huang       Huang, Eugene  1965-05-14
2            11002      Ruben   Torres       Torres, Ruben  1965-08-12
3            11003    Christy      Zhu        Zhu, Christy  1968-02-15
4            11004  Elizabeth  Johnson  Johnson, Elizabeth  1968-08-08
...            ...        ...      ...                 ...         ...
18479        29479      Tommy     Tang         Tang, Tommy  1958-07-04
18480        29480       Nina     Raji          Raji, Nina  1960-11-10
18481        29481       Ivan     Suri          Suri, Ivan  1960-01-05
18482        29482    Clayton    Zhang      Zhang, Clayton  1959-03-05
18483        29483      JÃ©sus  Navarro      Navarro, JÃ©sus  1959-12-08

      MaritalStatus Gender  YearlyIncome  TotalChildren  NumberChildrenAtHome  \
0                 M      M         90000              2                     0
1                 S      M         60000              3                     3
2                 M      M         60000              3                     3
3                 S      F         70000              0                     0
4                 S      F         80000              5                     5
...             ...    ...           ...            ...                   ...
18479             M      M         30000              1                     0
18480             S      F         30000              3                     0
18481             S      M         30000              3                     0
18482             M      M         30000              3                     0
18483             M      M         30000              0                     0

       ...    Occupation HouseOwnerFlag  NumberCarsOwned  \
0      ...  Professional              1                0
1      ...  Professional              0                1
2      ...  Professional              1                1
3      ...  Professional              0                1
4      ...  Professional              1                4
...    ...           ...            ...              ...
18479  ...      Clerical              1                0
18480  ...      Clerical              1                0
18481  ...      Clerical              0                0
18482  ...      Clerical              1                0
18483  ...      Clerical              1                0

                    AddressLine1 DateFirstPurchase CommuteDistance  \
0                3761 N. 14th St        2005-07-22       1-2 Miles
1                     2243 W St.        2005-07-18       0-1 Miles
2               5844 Linden Land        2005-07-10       2-5 Miles
3               1825 Village Pl.        2005-07-01      5-10 Miles
4            7553 Harness Circle        2005-07-26       1-2 Miles
...                          ...               ...             ...
18479          111, rue Maillard        2007-03-08       0-1 Miles
18480          9 Katherine Drive        2008-01-18       0-1 Miles
18481                Knaackstr 4        2006-02-13       0-1 Miles
18482     1080, quai de Grenelle        2007-03-22       0-1 Miles
18483  244, rue de la Centenaire        2007-03-13       0-1 Miles

           CustomerCity CustomerStateCode      CustomerState CustomerCountry
0           Rockhampton               QLD         Queensland       Australia
1               Seaford               VIC           Victoria       Australia
2                Hobart               TAS           Tasmania       Australia
3            North Ryde               NSW    New South Wales       Australia
4            Wollongong               NSW    New South Wales       Australia
...                 ...               ...                ...             ...
18479        Versailles                78            Yveline          France
18480            London               ENG            England  United Kingdom
18481               Hof                BY             Bayern         Germany
18482        Saint Ouen                17  Charente-Maritime          France
18483  Paris La Defense                92     Hauts de Seine          France

[18484 rows x 21 columns]>

### Describe - Statistical Analysis

In [14]:
df_csv.describe(include=['object'])

,FirstName,LastName,FullName,BirthDate,MaritalStatus,Gender,Education,Occupation,AddressLine1,DateFirstPurchase,CommuteDistance,CustomerCity,CustomerStateCode,CustomerState,CustomerCountry
count,18484,18484,18484,18484,18484,18484,18484,18484,18484,18484,18484,18484,18484,18484,18484
unique,670,375,18400,8252,2,2,5,5,12802,1124,5,269,53,53,6
top,Katherine,Diaz,"Pal, Mohamed",1967-05-14,M,M,Bachelors,Professional,AttachÃ© de Presse,2008-06-14,0-1 Miles,London,CA,California,United States
freq,97,209,3,12,10011,9351,5356,5520,17,56,6310,420,4444,4444,7819

In [16]:
df_csv.describe(include='all')

,CustomerKey,FirstName,LastName,FullName,BirthDate,MaritalStatus,Gender,YearlyIncome,TotalChildren,NumberChildrenAtHome,...,Occupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,DateFirstPurchase,CommuteDistance,CustomerCity,CustomerStateCode,CustomerState,CustomerCountry
count,18484.000000,18484,18484,18484,18484,18484,18484,18484.000000,18484.000000,18484.000000,...,18484,18484.000000,18484.000000,18484,18484,18484,18484,18484,18484,18484
unique,NaN,670,375,18400,8252,2,2,NaN,NaN,NaN,...,5,NaN,NaN,12802,1124,5,269,53,53,6
top,NaN,Katherine,Diaz,"Pal, Mohamed",1967-05-14,M,M,NaN,NaN,NaN,...,Professional,NaN,NaN,AttachÃ© de Presse,2008-06-14,0-1 Miles,London,CA,California,United States
freq,NaN,97,209,3,12,10011,9351,NaN,NaN,NaN,...,5520,NaN,NaN,17,56,6310,420,4444,4444,7819
mean,20241.500000,NaN,NaN,NaN,NaN,NaN,NaN,57305.777970,1.844352,1.004058,...,NaN,0.676369,1.502705,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,5336.015523,NaN,NaN,NaN,NaN,NaN,NaN,32285.841703,1.612408,1.522660,...,NaN,0.467874,1.138394,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,11000.000000,NaN,NaN,NaN,NaN,NaN,NaN,10000.000000,0.000000,0.000000,...,NaN,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,15620.750000,NaN,NaN,NaN,NaN,NaN,NaN,30000.000000,0.000000,0.000000,...,NaN,0.000000,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,20241.500000,NaN,NaN,NaN,NaN,NaN,NaN,60000.000000,2.000000,0.000000,...,NaN,1.000000,2.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,24862.250000,NaN,NaN,NaN,NaN,NaN,NaN,70000.000000,3.000000,2.000000,...,NaN,1.000000,2.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,29483.000000,NaN,NaN,NaN,NaN,NaN,NaN,170000.000000,5.000000,5.000000,...,NaN,1.000000,4.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Value_Counts

In [17]:
df_csv.value_counts()

CustomerKey  FirstName  LastName   FullName            BirthDate   MaritalStatus  Gender  YearlyIncome  TotalChildren  NumberChildrenAtHome  Education            Occupation      HouseOwnerFlag  NumberCarsOwned  AddressLine1               DateFirstPurchase  CommuteDistance  CustomerCity      CustomerStateCode  CustomerState    CustomerCountry
11000        Jon        Yang       Yang, Jon           1966-04-08  M              M       90000         2              0                     Bachelors            Professional    1               0                3761 N. 14th St            2005-07-22         1-2 Miles        Rockhampton       QLD                Queensland       Australia          1
23419        Shawna     Xu         Xu, Shawna          1967-05-05  S              F       70000         5              5                     Bachelors            Professional    1               3                238 Montego                2008-05-01         10+ Miles        Coffs Harbour     NSW                New South Wales  Australia          1
23327        Madison    Moore      Moore, Madison      1980-06-03  S              F       30000         0              0                     Partial College      Skilled Manual  0               2                841 Meadowbrook            2008-04-05         1-2 Miles        Daly City         CA                 California       United States      1
23326        Tiffany    Ye         Ye, Tiffany         1980-07-22  S              F       40000         0              0                     Partial High School  Clerical        0               2                9069 Muir Road             2008-02-19         5-10 Miles       Bellflower        CA                 California       United States      1
23325        Tiffany    Zimmerman  Zimmerman, Tiffany  1951-02-22  M              F       20000         2              1                     Partial High School  Clerical        1               2                4701 Mt. Dell Drive        2007-01-26         5-10 Miles       Geelong           VIC                Victoria         Australia          1
                                                                                                                                                                                                                                                                                                                                                          ..
17160        Louis      Andersen   Andersen, Louis     1950-01-04  M              M       60000         2              1                     Partial College      Professional    1               2                1061 Delta Fair Blvd.      2008-05-15         10+ Miles        Bremerton         WA                 Washington       United States      1
17159        Kellie     Ruiz       Ruiz, Kellie        1950-10-04  S              F       60000         2              1                     Partial College      Professional    1               2                9905 North 29th St.        2007-12-07         2-5 Miles        Bellingham        WA                 Washington       United States      1
17158        Mitchell   Nara       Nara, Mitchell      1950-05-16  M              M       60000         2              1                     Partial College      Professional    1               2                21 Redhead Way             2007-09-23         10+ Miles        Bellingham        WA                 Washington       United States      1
17157        Wyatt      Johnson    Johnson, Wyatt      1949-12-17  M              M       70000         5              1                     Partial College      Professional    1               2                5297 Algiers Drive         2008-05-01         10+ Miles        Woodland Hills    CA                 California       United States      1
29483        JÃ©sus      Navarro    Navarro, JÃ©sus      1959-12-08  M              M       30000         0              0                     Bachelors            Clerical        1               0                244, rue de la Centenaire  2007-03-13         0-1 Miles        Paris La Defense  92                 Hauts de Seine   France             1
Length: 18484, dtype: int64

### Correlation Analysis

In [18]:
df_csv.corr

<bound method DataFrame.corr of        CustomerKey  FirstName LastName            FullName   BirthDate  \
0            11000        Jon     Yang           Yang, Jon  1966-04-08
1            11001     Eugene    Huang       Huang, Eugene  1965-05-14
2            11002      Ruben   Torres       Torres, Ruben  1965-08-12
3            11003    Christy      Zhu        Zhu, Christy  1968-02-15
4            11004  Elizabeth  Johnson  Johnson, Elizabeth  1968-08-08
...            ...        ...      ...                 ...         ...
18479        29479      Tommy     Tang         Tang, Tommy  1958-07-04
18480        29480       Nina     Raji          Raji, Nina  1960-11-10
18481        29481       Ivan     Suri          Suri, Ivan  1960-01-05
18482        29482    Clayton    Zhang      Zhang, Clayton  1959-03-05
18483        29483      JÃ©sus  Navarro      Navarro, JÃ©sus  1959-12-08

      MaritalStatus Gender  YearlyIncome  TotalChildren  NumberChildrenAtHome  \
0                 M      M         90000              2                     0
1                 S      M         60000              3                     3
2                 M      M         60000              3                     3
3                 S      F         70000              0                     0
4                 S      F         80000              5                     5
...             ...    ...           ...            ...                   ...
18479             M      M         30000              1                     0
18480             S      F         30000              3                     0
18481             S      M         30000              3                     0
18482             M      M         30000              3                     0
18483             M      M         30000              0                     0

       ...    Occupation HouseOwnerFlag  NumberCarsOwned  \
0      ...  Professional              1                0
1      ...  Professional              0                1
2      ...  Professional              1                1
3      ...  Professional              0                1
4      ...  Professional              1                4
...    ...           ...            ...              ...
18479  ...      Clerical              1                0
18480  ...      Clerical              1                0
18481  ...      Clerical              0                0
18482  ...      Clerical              1                0
18483  ...      Clerical              1                0

                    AddressLine1 DateFirstPurchase CommuteDistance  \
0                3761 N. 14th St        2005-07-22       1-2 Miles
1                     2243 W St.        2005-07-18       0-1 Miles
2               5844 Linden Land        2005-07-10       2-5 Miles
3               1825 Village Pl.        2005-07-01      5-10 Miles
4            7553 Harness Circle        2005-07-26       1-2 Miles
...                          ...               ...             ...
18479          111, rue Maillard        2007-03-08       0-1 Miles
18480          9 Katherine Drive        2008-01-18       0-1 Miles
18481                Knaackstr 4        2006-02-13       0-1 Miles
18482     1080, quai de Grenelle        2007-03-22       0-1 Miles
18483  244, rue de la Centenaire        2007-03-13       0-1 Miles

           CustomerCity CustomerStateCode      CustomerState CustomerCountry
0           Rockhampton               QLD         Queensland       Australia
1               Seaford               VIC           Victoria       Australia
2                Hobart               TAS           Tasmania       Australia
3            North Ryde               NSW    New South Wales       Australia
4            Wollongong               NSW    New South Wales       Australia
...                 ...               ...                ...             ...
18479        Versailles                78            Yveline          France
18480            London               ENG            England  United Kingdom
18481               Hof                BY             Bayern         Germany
18482        Saint Ouen                17  Charente-Maritime          France
18483  Paris La Defense                92     Hauts de Seine          France

[18484 rows x 21 columns]>

### Null Values

In [21]:
df_csv_nulls = df_csv.isna().any()
print(df_csv_nulls)

CustomerKey             False
FirstName               False
LastName                False
FullName                False
BirthDate               False
MaritalStatus           False
Gender                  False
YearlyIncome            False
TotalChildren           False
NumberChildrenAtHome    False
Education               False
Occupation              False
HouseOwnerFlag          False
NumberCarsOwned         False
AddressLine1            False
DateFirstPurchase       False
CommuteDistance         False
CustomerCity            False
CustomerStateCode       False
CustomerState           False
CustomerCountry         False
dtype: bool

### WRITE FILE